<template lang='pug'>
  .posts
    .posts_pagination-wrapper
      ul.posts_pagination-list
        li.posts_pagination-item(v-for="(btn, index) in BtnsAmount" @click.prevent="displayPosts" v-bind:class="{active: index===currentIndex}") {{ btn }}
    .posts_list-wrapper
      ul.posts_list
        transition-group(name="fade")
          .posts_item(v-for="post in currentPosts" :key="post.id")
            .posts_title {{post.title}}
            .posts_date {{post.date}}
            .posts_text {{post.text}}
</template>

<script>
export default {
  name: "Posts",
  components: {},
  data() {
    return {
      currentIndex: 0,
      posts: [
        {
          id: 0,
          title: "title0",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 1,
          title: "title1",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 2,
          title: "title2",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 3,
          title: "title3",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 4,
          title: "title4",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 5,
          title: "title5",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 6,
          title: "title6",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 7,
          title: "title7",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 8,
          title: "title8",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 9,
          title: "title9",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 10,
          title: "title10",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 11,
          title: "title11",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 12,
          title: "title12",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 13,
          title: "title13",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 14,
          title: "title14",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 15,
          title: "title15",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 16,
          title: "title16",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 17,
          title: "title17",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 18,
          title: "title18",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 19,
          title: "title19",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 20,
          title: "title20",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 21,
          title: "title21",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 22,
          title: "title22",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 23,
          title: "title23",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 24,
          title: "title24",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 25,
          title: "title25",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 26,
          title: "title26",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 27,
          title: "title27",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 28,
          title: "title28",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 29,
          title: "title29",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 30,
          title: "title30",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 31,
          title: "title31",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 32,
          title: "title32",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 33,
          title: "title33",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 34,
          title: "title34",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 35,
          title: "title35",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 36,
          title: "title36",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 37,
          title: "title37",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 38,
          title: "title38",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 39,
          title: "title39",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 40,
          title: "title40",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 41,
          title: "title41",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 42,
          title: "title42",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 43,
          title: "title43",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 44,
          title: "title44",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 45,
          title: "title45",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 46,
          title: "title46",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 47,
          title: "title47",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 48,
          title: "title48",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 49,
          title: "title49",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 50,
          title: "title50",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 51,
          title: "title51",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 52,
          title: "title52",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 53,
          title: "title53",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 54,
          title: "title54",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 55,
          title: "title55",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 56,
          title: "title56",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 57,
          title: "title57",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 58,
          title: "title58",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 59,
          title: "title59",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 60,
          title: "title60",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 61,
          title: "title61",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 62,
          title: "title62",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 63,
          title: "title63",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 64,
          title: "title64",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 65,
          title: "title65",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 66,
          title: "title66",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 67,
          title: "title67",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 68,
          title: "title68",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 69,
          title: "title69",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 70,
          title: "title70",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 71,
          title: "title71",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 72,
          title: "title72",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 73,
          title: "title73",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 74,
          title: "title74",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 75,
          title: "title75",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 76,
          title: "title76",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 77,
          title: "title77",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 78,
          title: "title78",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 79,
          title: "title79",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 80,
          title: "title80",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 81,
          title: "title81",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 82,
          title: "title82",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 83,
          title: "title83",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 84,
          title: "title84",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 85,
          title: "title85",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 86,
          title: "title86",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 87,
          title: "title87",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 88,
          title: "title88",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 89,
          title: "title89",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 90,
          title: "title90",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 91,
          title: "title91",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 92,
          title: "title92",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 93,
          title: "title93",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 94,
          title: "title94",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        },
        {
          id: 95,
          title: "title95",
          date: "11.12.2018",
          text:
            "В далеком и далеко не новом комплекте измерений, в том крыле космоса, которое никогда не предназначалось для полета, клубящиеся звездные туманы дрожат, расступаются и… Смотрите… То приближается Великий А'Туин, черепаха, медленно плывущая по межзвездному проливу. На Ее могучих ластах инеем застыл водород, Ее гигантский и древний панцирь изрыт метеоритными кратерами, а глаза величиной с два моря, покрытые слизью и астероидной пылью, неотрывно глядят в сторону Цели. В Ее мозгу, превышающем размерами город, с геологической медлительностью ворочаются мысли, и все они – о Бремени. Большую часть Бремени составляют четыре исполинских слона, на чьих спинах покоится диск Плоского мира, накрытый нежно-голубым куполом Небес."
        }
      ],
      currentPosts: [],
      BtnsAmount: 0
    };
  },
  methods: {
    displayPosts: function(event) {
      let button = event.target;
      let btnIndex = Number(button.innerText);
      this.currentIndex = btnIndex - 1;
      let firstPostIndex = btnIndex * 10 - 10;
      let lastPostIndex = btnIndex * 10 - 1;
      this.currentPosts = this.posts.slice(firstPostIndex, lastPostIndex);
    }
  },
  mounted: function() {
    this.BtnsAmount = Math.ceil(this.posts.length / 10);
    this.currentPosts = this.posts.slice(0, 10);
  }
};
</script>

<style lang='scss' scoped>
@import "../../components/common/mixins.scss";

.posts {
  margin-top: rem(16px);

  &_item {
    padding: rem(16px);
    margin-bottom: rem(16px);
    box-shadow: 0 0 rem(10px) rgba(0, 0, 0, 0.5);
  }
  &_title {
    font-size: rem(24px);
  }
  &_date {
    font-size: rem(14px);
  }

  &_pagination {
    &-wrapper {
      margin-bottom: rem(16px);
    }
    &-list {
      display: flex;
      flex-direction: row;
    }
    &-item {
      cursor: pointer;
      min-width: rem(48px);
      min-height: rem(48px);
      text-align: center;
      line-height: rem(48px);
      border: rem(1px) solid $medium_green;
      border-left: none;
      &:nth-child(1) {
        border-left: rem(1px) solid $medium_green;
        border-top-left-radius: rem(3px);
        border-bottom-left-radius: rem(3px);
      }
      &:nth-last-child(1) {
        border-top-right-radius: rem(3px);
        border-bottom-right-radius: rem(3px);
      }

      &:hover,
      &.active {
        transition: 0.3s;
        background-color: $medium_green;
        color: #fff;
      }
    }
  }
}

.fade-enter-active {
  transition: all 0.3s ease;
  transition-delay: 0.3s;
}
.fade-leave-active {
  transition: all 0.3s ease;
}
.fade-enter,
.fade-leave-to {
  opacity: 0;
}
</style>
